#+BEGIN_COMMENT
.. title: CodeWars: Not Very Secure
.. slug: codewars-not-very-secure
.. date: 2023-12-05 17:31:16 UTC-05:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-36ca607e-e6f8-427c-ad52-b03e7fd2c679-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
* A Solution

The problem-page on CodeWars shows a "RegularExpressions" tag so I'm going to assume that that's the way to solve it. My first thought was to use the ~\w~ special character, but the documentation says:

#+begin_quote
Matches Unicode word characters; this includes alphanumeric characters (as defined by ~str.isalnum()~) as well as the underscore (~_~). If the ASCII flag is used, only ~[a-zA-Z0-9_]~ is matched.
#+end_quote

The description says that it's equivalent to ~[a-zA-Z0-9_]~, so we can't use it (we don't want underscores), but if we use the same character ranges and leave out the underscore, it should work.

#+begin_src python :results none
ALPHANUMERIC = "[a-zA-Z0-9]"
ONE_OR_MORE = "+"

PATTERN_ONE = re.compile(ALPHANUMERIC + ONE_OR_MORE)

def submitted(password: str) -> bool:
    """Check if the input is alphanumeric

    Args:

     - password: string to check

    Returns:

      True if alphanumeric False otherwise
    """
    return PATTERN_ONE.fullmatch(password) is not None

tester(submitted)
#+end_src

As a check, I'll see what happens if I used the ~\w~ instead.

#+begin_src python :results output :exports both
WITH_UNDERSCORES = re.compile("\w" + ONE_OR_MORE)

def allows_underscores(password: str) -> bool:
    """Checks if the password has only alphanumeric or underscore characters

    Args:

      - password: input to check

    Returns:

     - True if valid
    """
    return WITH_UNDERSCORES.fullmatch(password) is not None

JUST_UNDERSCORES = "____"
print(JUST_UNDERSCORES.isalnum())
print(allows_underscores(JUST_UNDERSCORES))

tester(allows_underscores)
#+end_src

#+RESULTS:
: False
: True

So, that was a surprise. Why did ~allows_underscores~ pass the tests? If you look back at the test-cases you'll see that none of them have just letters, digits, and underscores, if there's an underscore then there's also white-space or some other invalid character. Seems like there's a hole in their testing.

Let's add in a couple of cases that should fail.

#+begin_src python 
EXTRA = "".join(random.choices(ascii_letters + digits + "_", k=25)) + "_"
TEST_CASES_2 = TEST_CASES + [EXTRA, JUST_UNDERSCORES]

tester(allows_underscores, TEST_CASES_2, throw=False)
#+end_src

#+RESULTS:
: Failed Test Case: 'Z43gn97HOIeOBS2oivbna1tVW_' Expected: False Actual: True
: Failed Test Case: '____' Expected: False Actual: True

That's better.

